app/controllers/admin/categories_controller.rb

INSERT INTO `categories` (`name`, `parent_id`, `created_at`, `updated_at`) VALUES ('abc1', 27, '2019-07-23 06:45:39', '2019-07-23 06:45:39')
---
  def create
    @category = Category.new category_params
    if @category.save
      flash[:success] = t("alert.created", obj: Category.name)

UPDATE `categories` SET `parent_id` = 0, `updated_at` = '2019-07-23 06:05:12' WHERE `categories`.`id` = 22
UPDATE `categories` SET `name` = 'abc3', `updated_at` = '2019-07-24 09:50:01' WHERE `categories`.`id` = 27
---
  def update
    if @category.update category_params
      flash[:success] = t("alert.updated", obj: Category.name)

DELETE FROM `categories` WHERE `categories`.`id` = 15
---
  def destroy
    if @category.destroy

SELECT  `categories`.* FROM `categories` WHERE `categories`.`id` IS NULL LIMIT 1
---
    def get_category
      @category = Category.find_by id: params[:id]