app/controllers/admin/savings_controller.rb

SELECT  `savings`.* FROM `savings` LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM `savings`
---
  def index
    @savings = Saving.page(params[:page]).per Settings.savings_per_page

INSERT INTO `savings` (`savingInYear`, `created_at`, `updated_at`) VALUES (10000000, '2019-07-22 07:16:30', '2019-07-22 07:16:30')
---
  def create
    @saving = Saving.new saving_params
    if @saving.save
      flash[:success] = t("alert.created", obj: Saving.name)

DELETE FROM `savings` WHERE `savings`.`id` = 61
---
  def destroy
    if @saving.destroy

SELECT  `savings`.* FROM `savings` WHERE `savings`.`id` = 1 LIMIT 1
---
    def get_saving
      @saving = Saving.find_by id: params[:id]