app/controllers/admin/users_controller.rb

SELECT  `users`.* FROM `users` LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM `users`
---
  def index
    @users = User.page(params[:page]).per Settings.users_per_page

INSERT INTO `users` (`name`, `email`, `phone`, `address`, `username`, `password_digest`, `created_at`, `updated_at`) VALUES ('hau', 'hn@maill.com', '123456', '6', 'ok', '$2a$10$5iHBLv/W5nEO2Edd9L93.OnJfTlpzYRJZdgpvzd4TEEh2l2/AcoZK', '2019-07-23 08:57:08', '2019-07-23 08:57:08')
---
  def create
    @user = User.new user_params
    if @user.save
      flash[:success] = t("alert.created", obj: User.name)

UPDATE `users` SET `name` = 'Lashanda Hilpert333', `updated_at` = '2019-07-23 08:45:23' WHERE `users`.`id` = 2
---
  def update
    if @user.update user_params

DELETE FROM `users` WHERE `users`.`id` = 2
---
  def destroy
    if @user.destroy

SELECT  `users`.* FROM `users` WHERE `users`.`id` IS NULL LIMIT 1
---
    def get_user
      @user = User.find_by id: params[:id]