app/controllers/month_intenses_controller.rb

UPDATE `users` SET `month_intense` = 1234567.0, `updated_at` = '2019-07-30 04:50:06' WHERE `users`.`id` = 1
---
  def create
    if current_user.update user_params