app/controllers/report_controller.rb

SELECT `finances_users`.* FROM `finances_users` WHERE `finances_users`.`user_id` = 1
SELECT `finances`.* FROM `finances` WHERE `finances`.`id` IN (1, 6, 4, 3)
SELECT `finances_users`.* FROM `finances_users` WHERE `finances_users`.`user_id` = 1 AND `finances_users`.`status` = TRUE
---
  def month_report
    @transactions = FinancesUser.includes(:finance).by_user_id current_user.id

    income_transactions = @transactions.by_status(true)
    expense_transactions = @transactions - income_transactions
    gon.hash_gon = {income_amout: income_transactions.pluck(:amout).sum,
    expense_amout: expense_transactions.pluck(:amout).sum}

    @number_transactions = JSON.parse(@transactions.to_json).size