app/controllers/savings_controller.rb

SELECT  `savings`.* FROM `savings` WHERE `savings`.`saving_in_year` = 12345672.0 LIMIT 1
INSERT INTO `savings` (`saving_in_year`, `created_at`, `updated_at`) VALUES (1010213.0, '2019-07-30 04:45:19', '2019-07-30 04:45:19')
UPDATE `users` SET `saving_id` = 62, `updated_at` = '2019-07-30 04:45:20' WHERE `users`.`id` = 1
---
  def create
    number_format = format_number saving_params[:saving_in_year]
    saving = Saving.find_by saving_in_year: number_format
    ActiveRecord::Base.transaction do
      saving ||= Saving.create saving_in_year: number_format
      return unless current_user.update! saving_id: saving.id