app/controllers/users_controller.rb

SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
---
    def load_user
      @user = User.find_by id: params[:id]